Public Attributes | List of all members
API_ConnectionGuidItem Struct Reference
Element Manager API
Represents a wall or beam connection. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Guid  | guid
guid of the wall, beam, or beam segment connected with its reference line to the given element.
bool  | conWithBeg
The wall, beam, or beam segment is connected with its beginning or the end point.
Detailed Description
Represents a wall or beam connection.
Remarks
For more details see API_WallRelation, API_BeamRelation, and API_BeamSegmentRelation structures.
Member Data Documentation
◆ conWithBeg
 API_ConnectionGuidItem::conWithBeg
The wall, beam, or beam segment is connected with its beginning or the end point.
◆ guid
 API_ConnectionGuidItem::guid
guid of the wall, beam, or beam segment connected with its reference line to the given element.